# chapter 1. Python Based Machine Learning

## Data Handling

### Pandas 시작 

**Pandas**는 파이썬의 내부 데이터뿐만 아니라 CSV 파일을 쉽게 DataFrame으로 변경해 데이터의 가공, 분석을 편리하게 수행할 수 있도록 해준다. <br>
Pandas의 핵심 객체는 **DataFrame**이다. <br>
**DataFrame은 여러 개의 행과 열로 이뤄진 2차원 데이터를 담는 데이터 구조체**이다. <br>
**Index**는 RDBMS의 PK처럼 개별 **데이터를 고유하게 식별하는 Key 값**이다. <br>

DataFrame과 Series의 가장 큰 차이점은 **Series는 column이 하나뿐인 데이터 구조체**이고, **DataFrame은 column이 여러 개인 데이터 구조체**라는 점이다. <br>
**DataFrame은 여러 개의 Series로 이뤄졌다고 할 수 있다.** <br>
Pandas는 **csv, tab과 같은 다양한 유형의 분리 문자로 column을 분리한 파일을 손쉽게 DataFrame으로 로딩**할 수 있게 해준다.

In [116]:
import pandas as pd

Pandas는 다양한 포맷으로 된 파일을 **DataFrame으로 로딩**할 수 있는 편리한 **API**를 제공한다. <br>
대표적으로 **read_csv(), read_table(), read_fwf()** 가 있다. 

**read_csv(filepath_or_buffer, sep='', ...)** <br>
**filepath**에는 로드하려는 데이터 파일 경로를 포함한 파일명을 입력한다. <br>
나머지 인자는 지정하지 않으면 디폴트 값으로 할당된다.

In [183]:
titanic_df = pd.read_csv(r'/Users/1001l1000/Documents/AI-Tech/ML/data/titanic_train.csv')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

**DataFrame.head()** 는 DataFrame의 **맨 앞에 있는 N개의 row를 반환**한다.

In [184]:
titanic_df = pd.read_csv(r'/Users/1001l1000/Documents/AI-Tech/ML/data/titanic_train.csv')
print('titanic 변수 type : ', type(titanic_df))
titanic_df

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0              1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1              2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2              3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3              4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4              5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S
..           ...       ...     ...             ...     ...   ...    ...    ...             ...      ...   ...      ...
886          887         0       2  Montvila, R...    male  27.0      0      0          211536  13.0000   NaN        S
887          888         1       1  Graham, Mis...  female  19.0      0      0          112053  30.0000   B42        S
888          889         0       3  Johnston, M...  female   NaN      1      2      W./C. 6607  23.4500   NaN        S
889          890         1       1  Behr, Mr. K...    male  26.0      0      0          111369  30.0000  C148        C
890          891         0       3  Dooley, Mr....    male  32.0      0      0          370376   7.7500   NaN        Q

[891 rows x 12 columns]

**pd.read_csv()** 는 호출 시 파일명 인자로 들어온 파일을 로딩해 **DataFrame 객체로 반환**한다. <br>
read_csv()는 별다른 파라미터 지정이 없으면 파일의 맨 처음 row를 column명으로 인지하고 column으로 변환한다. <br>
column명도 표시되지 않는 이 데이터가 **Pandas의 Index 객체 값**이다. <br>
모든 DataFrame 내 데이터는 **생성되는 순간 고유의 Index**를 가진다.

**DataFrame의 행과 열의 크기**를 알아보는 가장 좋은 방법은 생성된 **DataFrame 객체의 shape**를 이용하는 것이다. <br>
shape은 **DataFrame의 행과 열을 튜플 형태로 반환**한다.

In [119]:
print('Data의 크기 : ', titanic_df.shape)

Data의 크기 :  (891, 12)

DataFrame은 데이터뿐만 아니라 **column의 타입, Null 데이터 갯수, 데이터 분포도의 메타 데이터 등의 조회**가 가능하다. <br>
대표적인 메서드에는 **info()와 describe()** 가 있다.

In [120]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

RangeIndex는 DataFrame index의 범위를 나타내므로 전체 row 수를 출력할 수 있다. <br>
column별 데이터 타입을 나타낸다. <br>
Non-Null Count는 몇 개의 데이터가 non-null(Null 값이 아니다.)인지 나타낸다. <br>
dtype은 전체 12개의 column들의 타입을 요약한 것이다. 

**info()** 메서드를 통해 **총 데이터 건수와 데이터 타입, Null 건수**를 알 수 있다. <br>
**describe()** 메서드는 **칼럼별 숫자형 데이터값의 n-percentile 분포도, 평균값, 최댓값, 최솟값**을 나타낸다. <br>
자동으로 **object 타입의 column을 출력에서 제외**시킨다.

In [121]:
titanic_df.describe()

       PassengerId    Survived      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

**describe()** 는 **해당 숫자 column이 숫자형 카테고리 column인지 판단**할 수 있도록 도와준다.

**DataFrame의 [] 연산자 내부에 column명을 입력**하면 **Series 형태로 특정 column 데이터 세트가 반환**된다. <br>
Series 객체에 value_counts() 메서드를 호출하면 해당 column값의 유형과 건수를 확인할 수 있다. <br>
**value_counts()는 지정된 column의 데이터값 건수를 반환**한다.

In [122]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

**DataFrame의 [] 연산자 내부에 column명을 입력**하면 해당 **column에 해당하는 Series 객체를 반환**한다.

In [123]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

**Series는 Index와 단 하나의 column으로 구성된 데이터 세트**이다. <br>
모든 **Series와 DataFrame은 Index를 반드시 가진다.**

In [124]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [125]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

**value_counts()가 반환하는 데이터 타입 역시 Series 객체**이다. <br>
**Index**는 단순히 순차값과 같은 의미 없는 식별자만 할당하는 것이 아니라 **고유성이 보장된다면 의미있는 데이터값 할당도 가능**하다. <br>
Index는 **DataFrame, Series가 만들어진 후에도 변경이 가능**하다. <br>
Index는 또한 숫자형뿐만 아니라 **문자열도 가능**하다. 단 모든 Index는 고유성이 보장돼야 한다. <br>

value_counts() 메서드를 사용할 때는 Null 값을 무시하고 결괏값을 내놓기 쉽다는 점을 유의해야 한다. <br>
**value_counts()는 Null 값을 포함**하며 **개별 데이터 값의 건수를 계산**할지 **dropna 인자**로 판단한다. <br>
dropna의 **기본 값은 True이며 Null 값을 무시하고 개별 데이터 값의 건수를 계산**한다.

In [126]:
print('titanic_df 데이터 건수 : ', titanic_df.shape[0])
print('기본 설정인 dropna = True로 value_counts()')

# value_counts()는 디폴트로 dropna = True이므로 value_counts(dropna = True)와 동일하다.
print(titanic_df['Embarked'].value_counts())
print(titanic_df['Embarked'].value_counts(dropna = False))

titanic_df 데이터 건수 :  891
기본 설정인 dropna = True로 value_counts()
S    644
C    168
Q     77
Name: Embarked, dtype: int64
S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

### DataFrame과 리스트, 딕셔너리, Numpy ndarray 상호 변환 

기본적으로 DataFrame은 파이썬의 리스트, 딕셔너리 그리고 Numpy ndarray 등 다양한 데이터로부터 생성될 수 있다. <br>
또한 DataFrame은 반대로 파이썬의 리스트, 딕셔너리 그리고 Numpy ndarray 등으로 변환될 수 있다. <br>

**DataFrame**은 리스트와 Numpy ndarray와 다르게 **column명을 가지고 있다.** <br>
column 덕분에 리스트와 Numpy ndarray보다 상대적으로 편하게 데이터 핸들링이 가능하다. <br>
**DataFrame으로 변환 시 column을 지정**해준다. 지정하지 않으면 자동으로 column명을 할당한다. 

**DataFrame은 기본적으로 행과 열을 가지는 2차원 데이터**이다. <br>
**2차원 이하 데이터들만 DataFrame으로 변환될 수 있다.**

In [127]:
import numpy as np

col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print('array1 shape : ', array1.shape)

# 리스트를 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns = col_name1)
print('1차원 리스트로 만든 DataFrame : \n', df_list1)

# Numpy ndarray를 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns = col_name1)
print('1차원 ndarray로 만든 DataFrame : \n', df_array1)

array1 shape :  (3,)
1차원 리스트로 만든 DataFrame :
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame :
    col1
0     1
1     2
2     3

In [128]:
# 3개의 column이 필요하다. 
col_name2 = ['col1', 'col2', 'col3']

# 2행 X 3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환한다. 
list2 = [[1, 2, 3],
        [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape : ', array2.shape)
df_list2 = pd.DataFrame(list2, columns = col_name2)
print('2차원 리스트로 만든 DataFrame : \n', df_list2)
df_array2 = pd.DataFrame(array2, columns = col_name2)
print('2차원 ndarray로 만든 DataFrmae : \n', df_array2)

array2 shape :  (2, 3)
2차원 리스트로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrmae :
    col1  col2  col3
0     1     2     3
1    11    12    13

**딕셔너리를 DataFrame으로 변환** 시에는 **딕셔너리의 키를 column명**으로, **딕셔너리의 값은 키에 해당하는 column 데이터로 변환**된다. <br>
키의 경우는 문자열, 값의 경우는 리스트 형태로 딕셔너리를 구성한다.

In [129]:
# key는 문자열 column명으로 mapping, value는 리스트 형 또는 ndarray를 column 데이터로 mapping
dict = {'col1' : [1, 11], 'col2' : [2, 22], 'col3' : [3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame : \n', df_dict)

딕셔너리로 만든 DataFrame :
    col1  col2  col3
0     1     2     3
1    11    22    33

**DataFrame을 Numpy ndarray, 리스트, 딕셔너리로 변환** <br>
DataFrame을 이용하더라도 머신러닝 패키지의 입력 인자 등에 적용하기 위해 다시 Numpy ndarray로 변환하는 경우가 빈번하게 발생한다. <br>
DataFrame을 Numpy ndarray로 변환하는 것은 DataFrame 객체의 values를 이용해 쉽게 할 수 있다.

In [130]:
# DataFrame -> ndarray로 변환
array3 = df_dict.values
print('df_dict.values 타입 : ', type(array3), 'df_dict.values shape : ', array3.shape)
print(array3)

df_dict.values 타입 :  <class 'numpy.ndarray'> df_dict.values shape :  (2, 3)
[[ 1  2  3]
 [11 22 33]]

**DataFrame을 리스트와 딕셔너리로 변환**할 수 있다. <br>
**DataFrame -> 리스트**로 변환은 values로 얻은 ndarray에 **tolist()를 호출**하면 된다. <br>
**DataFrame 객체에 to_dict() 메소드를 호출**하는데, 인자로 **'list'를 입력**하면 **딕셔너리의 값 -> 리스트**형으로 반환된다.

In [131]:
# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입 : ', type(list3))
print(list3)

# DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입 : ', type(dict3))
print(dict3)

df_dict.values.tolist() 타입 :  <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입 :  <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### DataFrame의 column 데이터 세트 생성과 수정

**DataFrame의 column 데이터 세트 생성과 수정** 역시 **[] 연산자**를 이용해 쉽게 할 수 있다. <br>
DataFrame **[] 내에 새로운 column명을 입력하고 값을 할당**하면 된다.

In [132]:
titanic_df['Age_0'] = 0 # 일괄적으로 0을 할당 
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0

titanic_df['Age_0'] = 0과 같이 **Series에 상수값을 할당**하면 **Series의 모든 데이터 세트에 일괄적으로 적용**된다. <br>

In [133]:
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      220.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      380.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      260.0          1

In [134]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      360.0          1

### DataFrame 데이터 삭제 

DataFrame에서 **데이터 삭제는 drop() 메서드**를 이용한다. <br>
**DataFrame.drop(labels = None, axis = 0, index = None, columns = None, level = None, inplace = False, errors = 'raise')** <br>
가장 중요한 파라미터는 **labes, axis, inplace**이다. <br>
**axis 값에 따라 특정 column 또는 특정 행을 드롭**한다. <br>
**axis 0은 row 방향 축, axis 1은 column 방향 축**이다. <br>
DataFrame은 **2차원 데이터만 다루므로 axis 0, axis 1로만 axis가 구성**되어있다. <br>

DataFrame의 **특정 row를 가리키는 것은 Index**이다. <br>
**axis를 0으로 지정**하면 DataFrame은 자동으로 **labels에 오는 값을 Index로 간주**한다. <br>
**axis = 0으로 설정하고 row 레벨로 삭제하는 경우**는 **이상치 데이터를 삭제하는 경우**에 주로 사용된다.

In [135]:
# Age_0이 삭제된 df
titanic_drop_df = titanic_df.drop('Age_0', axis = 1)
titanic_drop_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      360.0          1

In [136]:
# 원본 titanic_df
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      320.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      480.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      360.0          1

**inplace = False로 설정**했기 때문에 **'Age_0' column은 존재**한다. <br>
inplace = False이면 **자기 자신의 DataFrame의 데이터는 삭제하지 않으며, 삭제된 결과 DataFrame을 반환**한다. <br>
**inplace = True로 설정하면 자신의 DataFrame의 데이터를 삭제**한다. <br>

**여러 개의 column을 삭제**하고 싶으면 **리스트 형태로 삭제하고자 하는 column명을 입력해 labels 파라미터로 입력**하면 된다.

In [137]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis = 1, inplace = True)
print('inplace = True로 drop 후 반환된 값 : ', drop_result)
titanic_df.head(3)

inplace = True로 drop 후 반환된 값 :  None

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

유의할 점은 **drop() 시 inplace = True로 설정하면 반환 값이 None**이 된다. <br>
따라서 **inplace = True로 설정한 채, 반환 값을 다시 자신의 DataFrame 객체로 할당하면 안된다.**

In [138]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('before axis 0 drop')
print(titanic_df.head(3))

titanic_df.drop([0, 1, 2], axis = 0, inplace = True)

print('after axis 0 drop')
print(titanic_df.head(3))

before axis 0 drop
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
after axis 0 drop
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

**drop() 메서드**에서 **axis와 inplace 인자를 적용해 DataFrame을 변경하는 방식** <br>

**axis** : DataFrame의 row를 삭제할 때는 axis = 0, column을 삭제할 때는 axis = 1로 설정한다. <br>
**원본 DataFrame은 유지하고 드롭된 DataFrame을 새롭게 객체 변수로 받고 싶다**면 **inplace = False**로 설정한다. <br>
**원본 DataFrame에 드롭된 결과를 적용할 경우**에는 **inplace = True**를 적용한다. <br>
원본 DataFrame에서 드롭된 DataFrame을 다시 원본 DataFrame 객체 변수로 할당하면 원본 DataFrame에서 드롭된 결과를 적용할 경우와 같다. 
(단 기존 원본 DataFrame 객체 변수는 메모리에서 추후 제거된다.)

### Index 객체

**Pandas의 Index** 객체는 RDBMS의 PK와 유사하게 **DataFrame, Series의 레코드를 고유하게 식별하는 객체**이다. <br>
**DataFrame, Series에서 Index 객체만 추출**하려면 **DataFrame.index 또는 Series.index 속성**을 통해 가능하다. <br>
Index 객체의 **values 속성으로 ndarray 값을 알 수 있다.**

In [185]:
# 원본파일 다시 로드 
titanic_df = pd.read_csv(r'/Users/1001l1000/Documents/AI-Tech/ML/data/titanic_train.csv')

# Index 객체 추출
indexes = titanic_df.index
print(indexes)

# Index 객체를 실제 값 array로 변환
print('Index 객체 array 값 : \n', indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체 array 값 :
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

**Index 객체는 식별성 데이터를 1차원 array로 가지고 있다.** <br>
ndarray와 유사하게 **단일 값 반환 및 슬라이싱도 가능**하다.

In [140]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

하지만 한 번 만들어진 **DataFrame 및 Series의 Index 객체는 변경할 수 없다.** <br>
따라서 indexes[0] = 5는 TypeError를 반환한다. <br>
**Index는 오직 식별용으로만 사용된다.**

In [141]:
series_fair = titanic_df['Fare']
print('Fair Series max : ', series_fair.max())
print('Fair Series sum : ', series_fair.sum())
print('sum() Fair Series : ', sum(series_fair))
print('Fair Series + 3 : \n', (series_fair + 3).head(3))

Fair Series max :  512.3292
Fair Series sum :  28693.9493
sum() Fair Series :  28693.949299999967
Fair Series + 3 :
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

DataFrame 및 Series에 **reset_index() 메서드**를 수행하면 새롭게 **Index를 연속 숫자형으로 할당하며 기존 Index는 'index'라는 새로운 column명으로 추가**된다.

In [142]:
titanic_reset_df = titanic_df.reset_index(inplace = False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

**reset_index()** 는 Index가 연속된 int 숫자형 데이터가 아닐 경우에 다시 이를 **연속 int 숫자형 데이터를 만들 때** 주로 사용한다. <br>
Series에 reset_index()를 적용하면 Series가 아닌 **DataFrame이 반환**된다.

In [144]:
print('befoer reset_index')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_count 객체 변수 타입 : ', type(value_counts))
new_value_counts = value_counts.reset_index(inplace = False)
print('After reset_index')
print(new_value_counts)
print('new_value_counts 객체 변수 타입 : ', type(new_value_counts))

befoer reset_index
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_count 객체 변수 타입 :  <class 'pandas.core.series.Series'>
After reset_index
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts 객체 변수 타입 :  <class 'pandas.core.frame.DataFrame'>

**reset_index()의 parameter 중 drop = True로 설정**하면 기존 Index는 **새로운 column으로 추가되지 않고 삭제**된다. <br>
새로운 column이 추가되지 않으므로 **그대로 Series로 유지**된다.

### 데이터 셀렉션 및 필터링

**Numpy**의 경우 **'[]' 연산자 내 단일 값 추출, slicing, Fancy Indexing, Boolean Indexing**을 통해 **데이터를 추출**한다. <br>
**Pandas**의 경우 **iloc[]. loc[] 연산자**를 통해 동일한 작업을 수행한다. <br>
DataFrame 바로 뒤에 있는 **'[]' 안에 들어갈 수 있는 것은 column명 문자, Index로 변환 가능한 표현식**이다. <br>
**DataFrame의 []는 column만 지정할 수 있는 'column 지정 연산자'이다.** <br>

**여러 개의 column에서 데이터를 추출**하려면 **['column1', 'column2']와 같이 리스트 객체를 이용**하면 된다.

In [186]:
print('단일 column 데이터 추출 : \n', titanic_df['Pclass'].head(3))
print('\n 여러 column의 데이터 추출 : \n', titanic_df[['Survived', 'Pclass']].head(3))
# print('[]안에 숫자 index는 key error 오류 발생 : \n', titanic_df[0])

단일 column 데이터 추출 :
 0    3
1    1
2    3
Name: Pclass, dtype: int64

 여러 column의 데이터 추출 :
    Survived  Pclass
0         0       3
1         1       1
2         1       3

**Pandas의 Index 형태로 변환 가능한 표현식은 [] 내에 입력**할 수 있다. <br>

In [149]:
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

**Boolean Indexing 표현도 가능**하다.

In [150]:
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

**DataFrame 바로 뒤 [] 연산자는 Numpy의 []나 Series의 []와는 다르다.** <br>
**DataFrame 바로 뒤의 [] 내 입력값은 column을 지정해 column 지정 연산에 사용하거나 Boolean Index용도로만 사용해야 한다.** <br>
DataFrame[0:2]와 같은 slicing 여연산으로 데이터를 추출하는 방법은 사용하지 않는 것이 좋다.

**DataFrame iloc[] 연산자** <br>

**Pandas는 DataFrame의 row나 column을 지정**하여 데이터를 선택할 수 있는 **Indexing 방식으로 iloc[]와 loc[]를 제공**한다. <br>
**iloc[]** 는 **위치 기반 Indexing 방식으로 동작**하며 **loc[]** 는 **명칭 기반 Indexing 방식으로 동작**한다. <br>
**위치 기반 Indexing**은 행과 열의 위치를, 0을 출발점으로 한느 세로축, 가로축 좌표 정숫값으로 지정하는 방식이다. <br>
**명칭 기반 Indexing**은 DataFrame의 Indexing 값으로 행 위치를, column의 명칭으로 열 위치를 지정하는 방식이다. <br>

**iloc[]는 위치 기반 Indexing만 허용**하기 때문에 행과 열의 좌표 위치에 해당하는 값으로 정숫값 또는 정수형 slicing, Fancy 리스트 값을 입력해야 한다.

In [151]:
data = {'Name' : ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'], 
       'Year' : [2011, 2016, 2015, 2015],
       'Gender' : ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [152]:
data_df.iloc[0, 0]

'Chulmin'

단 **iloc[]에 DataFrame의 Index 값이나 column명을 입력하면 오류**를 발생시킨다. <br>
**iloc[]는 열 위치에 -1을 입력**하여 가장 마지막 열 데이터를 가져오는데 **-1은 맨 마지막 데이터 값을 의미**한다.

In [154]:
print('맨 마지막 column 데이터 [:, -1] \n', data_df.iloc[:, -1])
print('맨 마지막 column을 제외한 모든 데이터 [:, :-1] \n', data_df.iloc[:, :-1])

맨 마지막 column 데이터 [:, -1]
 one        Male
two      Female
three      Male
four       Male
Name: Gender, dtype: object
맨 마지막 column을 제외한 모든 데이터 [:, :-1]
            Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
four    Soobeom  2015

**iloc[]은 slicing과 Fancy Indexing은 제공**하나 명확한 위치 기반 Indexing이 사용되어야 하는 제약으로 **Boolean Indexing은 제공하지 않는다.**

**DataFrame loc[] 연산자** <br>

**loc[]는 명칭 기반으로 데이터를 추출**한다. <br>
**행 위치에는 DataFrame Index 값**을, 그리고 **열 위치에는 column명을 입력해 loc[index 값, column명]과 같은 형식**으로 데이터를 추출한다.

In [155]:
data_df.loc['one', 'Name']

'Chulmin'

In [156]:
print('위치기반 iloc slicing \n', data_df.iloc[0:1, 0], '\n')
print('명칭기반 loc slicing \n', data_df.loc['one':'two', 'Name'])

위치기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

**[], iloc[], loc[]의 특징과 주의할 점** <br>

개별 또는 여러 column 값 전체를 추출하고자 한다면 iloc[]나 loc를 사용하지 않고 data_df['Name']과 같이 DataFrame['column명']으로 충분하다. <br>
하지만 **행과 열을 함께 사용해 추출해야 한다면 iloc[]나 loc[]를 사용**해야 한다. <br>
iloc[]와 loc[]를 이해하기 위해서는 명칭 기반 Indexing과 위치 기반 Indexing의 차이를 알아야 한다. <br>
**DataFrame의 Index나 column명으로 데이터에 접근하는 것 -> 명칭 기반 Indexing** <br>
**0부터 시작하는 행, 열의 위치 죄표에만 의존하는 것 -> 위치 기반 Indexing** <br>
**iloc[]는 위치 기반 Indexing만 가능**하다. 따라서 행과 열의 위치 값으로 정수형 값을 지정해 원하는 데이터를 반환한다. <br>
**loc[]는 명칭 기반 Indexing만 가능**하다. 따라서 행 위치에 DataFrame Index가 오며 열 위치에는 column명을 지정해 원하는 데이터를 반환한다. <br>
명칭 기반 Indexing에서 slicing을 '시작점:종료점'으로 지정할 때 시작점에서 종료점을 포함한 위치에 있는 데이터를 반환한다.

**Boolean Indexing** 

iloc나 loc와 같이 명확히 Indexing을 지정하는 방식 보다 Boolean Indexing에 의존해 데이터를 가져오는 경우가 더 많다. <br>
명칭이나 위치 지정 Indexing에서 가져올 값은 주로 로직이나 조건에 의해 계산한 뒤 행 위치, 열 위치 값으로 입력되는데, 그럴 필요 없이 처음부터 가져올 값을 조건으로 [] 내에 입력하면 자동으로 원하는 값을 필터링한다. <br>
**Boolean Indexing은 [], loc[]에서 공통으로 지원**한다.

In [187]:
# 원본파일 다시 로드 
titanic_df = pd.read_csv(r'/Users/1001l1000/Documents/AI-Tech/ML/data/titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

반환된 titanic_boolean 객체의 타입은 DataFrame이다. <br>
**column만 별도로 추출**할 수 있다.

In [158]:
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [159]:
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [160]:
titanic_df[(titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) &
          (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [161]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[cond1 & cond2 & cond3]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

### 정렬, Aggregation 함수, GroupBy 적용

**DateFrame, Series의 정렬 - sort_values()** <br>

**DataFrame과 Series의 정렬**을 위해서는 **sort_values()** 메서드를 이용한다. <br>
sort_values()의 주요 입력 파라미터는 by, ascending, inplace이다. <br>
**by**로 특정 column을 입력하면 **해당 column으로 정렬**을 수행한다. <br>
**ascending = True로 설정하면 오름차순으로 정렬**, **ascending = False로 설정하면 내림차순으로 정렬**한다. <br>
**inplace = False**로 설정하면 **sort_values()를 호출**한다. <br>
DataFrame은 그대로 유지하며 **정렬된 DataFrame을 결과로 반환**한다.

In [162]:
titanic_sorted = titanic_df.sort_values(by = ['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [163]:
titanic_sorted = titanic_df.sort_values(by = ['Pclass', 'Name'], ascending = False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

**Aggregation 함수 적용** <br>

DataFrame에서 **min(), max(), sum(), count()** 와 같은 **aggregation 함수**의 적용은 RDBMS SQL의 aggregation 함수 적용과 유사하다. <br>
DataFrame의 경우 **DataFrame에서 바로 aggregation을 호출할 경우 모든 column에 해당 aggregation을 적용**한다.

In [164]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

**특정 column에 aggregation 함수를 적용**하기 위해서는 DataFrame에 **대상 column들만 추출해 aggregation을 적용**하면 된다.

In [165]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

**groupby() 적용**

DataFrame의 groupby 사용 시 **입력 파라미터 by에 column을 입력하면 대상 column으로 groupby** 된다.
DataFrame에 groupby()를 호출하면 **DataFrameGroupBy**라는 또다른 형태의 DataFrame을 **반환**한다.

In [166]:
titanic_groupby = titanic_df.groupby(by = 'Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

SQL의 groupby와 다르게 DataFrame의 groupby()를 호출해 반환된 결과에 aggregation 함수를 호출하면 **groupby() 대상 column을 제외한 모든 column에 해당 aggregation 함수를 적용**한다.

In [167]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

DataFrame의 groupby()에 **특정 column만 aggregation 함수를 적용**하려면 groupby()로 반환된 DataFrameGroupBy 객체에 **해당 column을 필터링 한 뒤 aggregation 함수를 적용**한다.

In [168]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

DataFrame groupby()의 경우 적용하려는 **여러 개의 aggregation 함수명**을 DataFrameGroupBy 객체의 **agg() 내에 인자로 입력해서 사용**해야한다.

In [169]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [170]:
agg_format = {'Age' : 'max', 'SibSp' : 'sum', 'Fare' : 'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

### 결손 데이터 처리하기

Pandas는 **결손 데이터를 처리하는 API**를 제공한다. <br>
**결손 데이터는 column에 값이 없는, 즉 Null인 경우**를 의미하며, Numpy의 **NaN으로 표시**한다. <br>
기본적으로 머신러닝 알고리즘은 **NaN 값을 처리하지 않으므로 이 값을 다른 값으로 대체**해야 한다. <br>
또한 NaN 값은 평균, 총합 등의 **함수 연산 시 제외**된다.

**isna()로 결손 데이터 여부 확인** <br>

isna()는 데이터가 **NaN인지 아닌지 True, False**로 알려준다.

In [171]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

**결손 데이터의 갯수**는 isna() 결과에 **sum() 함수를 추가**해 구할 수 있다. <br>

In [172]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**fillna()로 결손 데이터 대체하기** <br>

**fillna()** 를 이용하면 결손 데이터를 편리하게 **다른 값으로 대체**할 수 있다. <br>

In [173]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

주의할 점은 **fillna()를 이용해 반환 값을 다시 받거나, inplace = True 파라미터를 fillna()에 추가**해야 **실제 데이터 세트 값이 변경**된다는 것이다.

In [174]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### apply lambda 식으로 데이터 가공

Pandas는 **apply 함수에 lambda 식을 결합**해 DataFrame이나 Series의 레코드별로 데이터를 가공하는 기능을 제공한다. <br>
column에 일괄적으로 데이터 가공을 하는 것이 속도 면에서 더 빠르나 **복잡한 데이터 가공이 필요할 경우**에는 **apply lambda**를 이용한다.

In [176]:
def get_square(a):
    return a ** 2

print('3의 제곱은 : ', get_square(3))

3의 제곱은 :  9

In [177]:
lambda_square = lambda x : x ** 2
print('3의 제곱은 : ', lambda_square(3))

3의 제곱은 :  9

**lambda x : x ** 2에서 ':'로 입력 인자와 반환될 입력 인자의 계산식을 분리**한다. <br>
':'의 왼쪽에 있는 x는 **입력 인자**이며, 오른쪽은 **입력 인자의 계산식**이다. <br>
오른쪽의 계산식은 **반환값**을 의미한다. <br>
**여러 개의 값을 입력 인자**로 사용해야 할 경우는 **map()** 함수를 결합해 사용한다.

In [178]:
a = [1, 2, 3]
square = map(lambda x : x ** 2, a)
list(square)

[1, 4, 9]

DataFrame의 **apply에 lambda 식을 적용**해 데이터를 가공할 수 있다.

In [180]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

lambda식은 if else를 지원하는데, 이 때 **if절의 경우 if식보다 반환값을 먼저 기술**해야 한다. <br>
**':' 기호의 오른편에 반환 값이 있어야하기 때문**이다.

In [181]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [182]:
# 나이에 따라 세분화된 분류를 실행하는 함수
def get_category(age):
    cat = ''
    if age <= 5 : cat = 'Baby'
    elif age <= 12 : 'Child'
    elif age <= 18 : 'Teenager'
    elif age <= 25 : 'Student'
    elif age <= 35 : 'Young Adult'
    elif age <= 60 : 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에 위에서 생성한 get_category() 함수를 반환값으로 지정
# get_category(X)는 입력값으로 'Age' column 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age Age_cat
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0